tap "homebrew/bundle"
tap "homebrew/services"

# Allow to manage pre-installed apps
cask_args adopt: true

# Manage App Store apps
brew "mas"

# Dotfiles
brew "chezmoi"

# CLI
cask "alacritty"
brew "fish"
brew "direnv"
brew "starship"

# Dev
brew "git"
brew "gh"
brew "git-delta"
brew "neovim"
cask "visual-studio-code"

# Python
brew "python@3.12"
brew "uv"

# Utils
brew "htop"
brew "wget"
brew "ripgrep"
brew "httpie"
brew "fd"

# System apps
brew "syncthing", restart_service: true
cask "karabiner-elements"  # remap keyboard or mouse keys
cask "raycast"
cask "magicquit"  # automatically kill unused apps
cask "tailscale"
cask "mos" # better mouse scrolling
cask "betterdisplay"  # more control over monitors, avoid blurry display

# Browser
cask "firefox"

# Multimedia apps
cask "moonlight"
cask "nvidia-geforce-now"
cask "sonos"
cask "steam"
cask "whatsapp"

# Other apps
cask "discord"
cask "obsidian"
cask "slack"

